views/inventorys/view.php

SELECT * FROM `user` WHERE `id`=13
---
                [
                    'attribute' => 'create_uid',
                    'value' => function ($model) {
                        $user = \app\models\User::findOne($model->create_uid);