views/layouts/header.php

SELECT `auth_assignment`.`item_name`, `user`.`updated_at` FROM `user` LEFT JOIN `auth_assignment` ON auth_assignment.user_id = user.id WHERE user.id = 13
---

                            <p>
                                <?php
                                    $user_list = app\models\User::find()
                                    ->select('auth_assignment.item_name,user.updated_at')
                                    ->leftJoin('auth_assignment','auth_assignment.user_id = user.id')
                                    ->where('user.id = '.Yii::$app->user->id)
                                    ->asArray()
                                    ->one();