controllers/InventorysController.php

    public function actionView($id)
    {
        $items =  InventorysItems::findAll(['inventory_id' => $id]);
---
SELECT * FROM `inventorys_items` WHERE `inventory_id`='100011'

    protected function findModel($id)
    {
        if (($model = Inventorys::findOne($id)) !== null) {
---
SELECT * FROM `inventorys` WHERE `id`='100011'