controllers/OrdersController.php

SELECT * FROM `user` WHERE id=1
---

        // 用户名
        foreach ($groupMember as &$value) {
            $member = $userModel->find()->where("id=" . $value["user_id"])->one();