controllers/ReceiptController.php

    public function actionPrintSkuCode($sku)
    {
        $qrCode = new QrCode();
        $sku_list = explode('|', trim($sku, '|'));
        $pdf_html = '';

        foreach ($sku_list as $v)
        {
            $sku_array = explode(':', $v);
            $sku = $sku_array[0];
            if($sku_array[1]>0)
            {
                $qrCode
                    ->setText($sku)
                    ->setSize(200)
                    ->setPadding(5)
                    ->setErrorCorrection('high')
                    ->setForegroundColor(array('r' => 0, 'g' => 0, 'b' => 0, 'a' => 0))
                    ->setBackgroundColor(array('r' => 255, 'g' => 255, 'b' => 255, 'a' => 0))
                    ->setLabel($sku)
                    ->setLabelFontSize(16)
                    ->setImageType(QrCode::IMAGE_TYPE_JPEG);

                file_put_contents(Yii::$app->basePath.'/web/images/tmp/'.$sku.'.jpg', base64_decode($qrCode->generate()));

                $title = '';
                $color = '';
                $size = '';

                $product_sku = ProductsVariant::find()->where(['sku' => $sku])->one();
---
SELECT * FROM `products_variant` WHERE `sku`='A00186PM01000'

                {
                    $color = $product_sku->color;
                    $size = $product_sku->size;
                    $product = ProductsBase::find()->where(['spu' => $product_sku->spu])->one();
---
SELECT * FROM `products_base` WHERE `spu`='A00186PM'

    public function actionPrintSkuCodeSingle($sku)
    {
        $qrCode = new QrCode();
        $qrCode
            ->setText($sku)
            ->setSize(200)
            ->setPadding(5)
            ->setErrorCorrection('high')
            ->setForegroundColor(array('r' => 0, 'g' => 0, 'b' => 0, 'a' => 0))
            ->setBackgroundColor(array('r' => 255, 'g' => 255, 'b' => 255, 'a' => 0))
            ->setLabel($sku)
            ->setLabelFontSize(16)
            ->setImageType(QrCode::IMAGE_TYPE_JPEG);

        file_put_contents(Yii::$app->basePath.'/web/images/tmp/'.$sku.'.jpg', base64_decode($qrCode->generate()));

        $title = '';
        $color = '';
        $size = '';

        $product_sku = ProductsVariant::find()->where(['sku' => $sku])->one();
        if($product_sku)
        {
            $color = $product_sku->color;
            $size = $product_sku->size;
            $product = ProductsBase::find()->where(['spu' => $product_sku->spu])->one();
---
SELECT * FROM `products_variant` WHERE `sku`='A00186PM01000'
SELECT * FROM `products_base` WHERE `spu`='A00186PM'

            }
        }

        $orders = Purchases::find()->where(['like', 'platform_track', $track])->all();
---
SELECT * FROM `purchases` WHERE `platform_track` LIKE '%70713800205711%'

        }
        $orderNumbers = substr($orderNumbers, 0, -1);
        // 收货反馈信息 jieson 2018.10.16
        $res = ReceiptFeedback::find()->where("order_number in ({$orderNumbers})")->select('create_uid, contents, type, create_time')->asArray()->all();
---
SELECT `create_uid`, `contents`, `type`, `create_time` FROM `receipt_feedback` WHERE order_number in ('20180926-45')