views/stock-logs/index.php

SELECT `country` FROM `orders` WHERE `id`='20180926-25'
---
                    'label' => '国家',
                    'format' => 'raw',
                    'value' => function ($data) {
                        $info = \app\models\Orders::find()->select('country')->where(array('id'=>$data->order_id))->one();

SELECT * FROM `user` WHERE `id`=13
---
                    'label' => '操作人',
                    'attribute' => 'uid',
                    'value' => function ($data) {
                        $user = \app\models\User::findOne($data->uid);