views/orders/index.php

SELECT * FROM `products_base` WHERE `spu`='D01170MM'
---
                    'format' => 'raw',
                    'value' => function ($data) {
                        $website = $data->getWebsite($data->website_id);
                        $product = \app\models\ProductsBase::find()->where(['spu' => $website->spu])->one();

SELECT * FROM `user` WHERE `id`=54
---
                [
                    'attribute' => 'uid',
                    'value' => function ($data) {
                        $user = \app\models\User::findOne($data->uid);