models/OrdersItem.php

    public function getProduct(){
        return ProductsVariant::find()->where(['sku' => $this->sku])->one();
---
SELECT * FROM `products_variant` WHERE `sku`=''