models/Orders.php

    public function getItems($order_id)
    {
        $items = OrdersItem::findAll(['order_id' => $order_id]);
---
SELECT * FROM `orders_item` WHERE `order_id`=600045225

    public function getWebsite($id)
    {
        $website = new Websites();
        $res = $website->find()->where(["id" => $id])->one();
---
SELECT * FROM `websites` WHERE `id`=2202

    public function countByCl($action){
        switch ($action){
            case 'mobile':
                return Orders::find()->where(['country' => $this->country, 'mobile' => trim($this->mobile)])->count();
---
SELECT COUNT(*) FROM `orders` WHERE (`country`='TH') AND (`mobile`='111')