models/ProductsVariant.php

SELECT * FROM `products_suppliers` WHERE `sku`='B00148MF02000'
SELECT * FROM `products_suppliers` WHERE `sku` LIKE '%Z00001PF\\%%'
---
    public function getBuyLink()
    {
        $spu = substr($this->sku, 0 ,8);
        $suppliers = ProductsSuppliers::find()->where(['sku' => $this->sku])->one();
        if($suppliers)
        {
            return $suppliers->url;
        }else{
            $suppliers = ProductsSuppliers::find()->where(['like', 'sku', $spu.'%'])->one();