models/User.php

    public  function getGroupUsers() {
        $res['is_admin'] = 0;
        $res['leader'] = 0;
        #客服
        $res['is_custom_service'] = 0;
        #采购
        $res['is_purchase'] = 0;
        #查询
        $res['is_select'] = 0;
        $res['data'] = array();
        $user_id = Yii::$app->user->getId();
        $Model = new User();
        $user_list = $Model->find()
            ->select('user.*,auth_assignment.item_name')
            ->leftJoin('auth_assignment','auth_assignment.user_id = user.id')
            ->where('user.id = '.$user_id)
            ->asArray()->one();
---
SELECT `user`.*, `auth_assignment`.`item_name` FROM `user` LEFT JOIN `auth_assignment` ON auth_assignment.user_id = user.id WHERE user.id = 13

    public function getUsers()
    {
        $user = $this->find()->all();
---
SELECT * FROM `user`