views/receipt/_track.php

                foreach ($items_list as $key => $list):
                    $sku_info = $skuModel->find()->where(['sku' => $list['sku']])->one();
                    $stock_code = 'SZ001';
                    $location_stock = LocationStock::find()->where(['sku' => $list['sku']])->andWhere(['stock_code' => $stock_code])->one();
---
SELECT * FROM `location_stock` WHERE (`sku`='A00186PM01000') AND (`stock_code`='SZ001')

                        $location_code = $location_stock->location_code;
                        $area_code = $location_stock->area_code;
                    }
                    $location_codes = \app\models\StockLocationCode::find()->where([
                        'stock_code' => $stock_code
                    ])->andWhere([
                        'area_code' => $area_code
                    ])->all();
---
SELECT * FROM `stock_location_code` WHERE (`stock_code`='SZ001') AND (`area_code`='A')